var province_color = {
    "广东": "#DD6B66",
    "河南": "#759AA0",
    "浙江": "#E69D87",
    "湖南": "#8DC1A9",
    "安徽": "#EA7E53",
    "江西": "#EEDD78",
    "江苏": "#73A373",
    "重庆": "#73B9BC",
    "山东": "#7289AB",
    "四川": "#91CA8C",
    "黑龙江": "#F49F42",
    "北京": "#AA312C",
    "上海": "#39656D",
    "福建": "#B35E45",
    "河北": "#4B8E6F",
    "陕西": "#B6481C",
    "广西": "#BBA838",
    "云南": "#386F38",
    "海南": "#388589",
    "贵州": "#385177",
    "山西": "#50964A",
    "辽宁": "#C16B0D",
    "天津": "#FF8500",
    "甘肃": "#45BFD3",
    "吉林": "#FF5F2F",
    "内蒙古":"#50F3A8",
    "新疆":"#FF4800",
    "宁夏":"#FFDE1A",
    "香港":"#41D541",
    "青海":"#32E7EF",
    "台湾":"#ef638e",
    "澳门":"#3B7CDE",
    "西藏":"#58FD4A",
    "湖北":"#FF190F"
}

var province_color_themeriver = {
    "广东": "#DD6B66",
    "河南": "#759AA0",
    "浙江": "#E69D87",
    "湖南": "#8DC1A9",
    "安徽": "#EA7E53",
    "江西": "#EEDD78",
    "江苏": "#73A373",
    "重庆": "#73B9BC",
    "山东": "#7289AB",
    "四川": "#91CA8C",
    "黑龙江": "#F49F42",
    "北京": "#AA312C",
    "上海": "#39656D",
    "福建": "#B35E45",
    "河北": "#4B8E6F",
    "陕西": "#B6481C",
    "广西": "#BBA838",
    "云南": "#386F38",
    "海南": "#388589",
    "贵州": "#385177",
    "山西": "#50964A",
    "辽宁": "#C16B0D",
    "天津": "#FF190F",
    "甘肃": "#45BFD3",
    "吉林": "#FF5F2F",
    "内蒙古":"#50F3A8",
    "新疆":"#FF4800",
    "宁夏":"#FFDE1A",
    "香港":"#41D541",
    "青海":"#32E7EF",
    "台湾":"#ef638e",
    "澳门":"#3B7CDE",
    "西藏":"#58FD4A",
    "湖北":"#FF8500"
}

// var province_color = {
//     "北京": "#de5991",
//     "天津": "#759AA0",
//     "河北": "#E69D87",
//     "山西": "#be3259",
//     "辽宁": "#EA7E53",
//     "黑龙江": "#EEDD78",
//     "上海": "#9359b1",
//     "江苏": "#cb8eb3",
//     "浙江": "#F49F42",
//     "安徽": "#AA312C",
//     "福建": "#B35E45",
//     "江西": "#4B8E6F",
//     "山东": "#B6481C",
//     "河南": "#BBA838",
//     "湖北": "#FF190F",
//     "湖南": "#206c71",
//     "广东": "#385177",
//     "广西": "#50964A",
//     "海南": "#C16B0D",
//     "重庆": "#245824",
//     "四川": "#45BFD3",
//     "贵州": "#50F3A8",
//     "云南": "#FF4800",
//     "陕西": "#FFDE1A",
//     "宁夏": "#41D541"
// }

const province_offset_x = {
    "广东": 5, "山东": 5, "河南": 30, "四川": 40, "江苏": 0, "河北": -25, "湖南": 5, "安徽": -10, "湖北": 0, "浙江": 35, "广西": 20, "云南": 0, "江西": 20, "辽宁": 45, "福建": 5, "陕西": 0, "黑龙江": -30, "山西": 10, "贵州": 10, "重庆": -10, "吉林": -35, "甘肃": 0, "内蒙古": -10, "新疆": -30, "上海": 0, "台湾": -0, "北京": 0, "天津": -30, "海南": 0, "香港": -2, "宁夏": 0, "青海": 25, "西藏": 0, "澳门": 0
}

const province_offset_y = {
    "广东": 45, "山东": 40, "河南": 20, "四川": 10, "江苏": -5, "河北": -5, "湖南": -5, "安徽": 35, "湖北": 35, "浙江": 20, "广西": -5, "云南": -5, "江西": 35, "辽宁": 40, "福建": -5, "陕西": -15, "黑龙江": -10, "山西": 40, "贵州": 0, "重庆": 35, "吉林": 15, "甘肃": 0, "内蒙古": -10, "新疆": 10, "上海": -5, "台湾": -20, "北京": 32, "天津": 20, "海南": -10, "香港": -10, "宁夏": 40, "青海": 20, "西藏": 0, "澳门": 0, "澳门": 0
}

const city_color = {
    "武汉":"#f99289",
    "孝感": "#fec8a5",
    "黄冈": "#febbc4",
    "荆州": "#f888c6",
    "鄂州": "#ab9cc5",
    "随州": "#9d6c87",
    "襄阳": "#86d9e2",
    "黄石": "#a1dbcb",
    "宜昌": "#d5dcbd",
    "荆门": "#fffab0",
    "咸宁": "#a2bcc6",
    "十堰": "#88a1aa",
    "仙桃": "#8eb0cb",
    "天门": "#ab9cc5",
    "恩施州": "#89bcef",
    "潜江": "#eac285",
    "神农架": "#f1c09a"
}

const qipao_city_color = {
    "武汉":"#ff1c12", //武汉
    "黄石":"#EA7E53", //黄石
    "十堰":"#E69D87", //十堰
    "荆州":"#759AA0", //荆州
    "宜昌":"#386F38", //宜昌
    "襄阳":"#ff6131", //襄阳
    "鄂州":"#DD6B66", //鄂州
    "荆门":"#EEDD78", //荆门
    "孝感":"#ffde1d", //孝感
    "黄冈":"#52f3a9", //黄冈
    "咸宁":"#4B8E6F", //咸宁
    "恩施州":"#73A373", //恩施州
    "随州":"#47c0d4", //随州
    "仙桃":"#ff8603", //仙桃
    "天门":"#d54873", //天门
    "潜江":"#1e9d95", //潜江
    "神农架":"#7289AB", //神农架
}

const city_offset_x = {
    "武汉": 0,
    "黄石": 10,
    "十堰": -36,
    "荆州": 40,
    "宜昌": -10,
    "襄阳": 0,
    "鄂州": 0,
    "荆门": -30,
    "孝感": 0,
    "黄冈": 0,
    "咸宁": 0,
    "恩施州": 0,
    "随州": 35,
    "仙桃": 0,
    "天门": -10,
    "潜江": 0,
    "神农架": 0
}

const city_offset_y = {
    "武汉": 45,
    "黄石": -20,
    "十堰": 30,
    "荆州": 10,
    "宜昌": 40,
    "襄阳": 40,
    "鄂州": 40,
    "荆门": 20,
    "孝感": 40,
    "黄冈": 40,
    "咸宁": -20,
    "恩施州": 40,
    "随州": 10,
    "仙桃": 35,
    "天门": -15,
    "潜江": 40,
    "神农架": 40
}