var province_color = {
    "广东": "#DD6B66",
    "河南": "#759AA0",
    "浙江": "#E69D87",
    "湖南": "#8DC1A9",
    "安徽": "#EA7E53",
    "江西": "#EEDD78",
    "江苏": "#73A373",
    "重庆": "#73B9BC",
    "山东": "#7289AB",
    "四川": "#91CA8C",
    "黑龙江": "#F49F42",
    "北京": "#AA312C",
    "上海": "#39656D",
    "福建": "#B35E45",
    "河北": "#4B8E6F",
    "陕西": "#B6481C",
    "广西": "#BBA838",
    "云南": "#386F38",
    "海南": "#388589",
    "贵州": "#385177",
    "山西": "#50964A",
    "辽宁": "#C16B0D",
    "天津": "#FF8500",
    "甘肃": "#45BFD3",
    "吉林": "#FF5F2F",
    "内蒙古":"#50F3A8",
    "新疆":"#FF4800",
    "宁夏":"#FFDE1A",
    "香港":"#41D541",
    "青海":"#32E7EF",
    "台湾":"#ef638e",
    "澳门":"#3B7CDE",
    "西藏":"#58FD4A",
    "湖北":"#FF190F"
}

const caiyun1 = [
    "#DD6B66", "#759AA0", "#E69D87", "#8DC1A9", "#EA7E53",
    "#EEDD78", "#73A373", "#73B9BC", "#7289AB", "#91CA8C",
    "#F49F42", "#AA312C", "#39656D", "#B35E45", "#4B8E6F",
    "#B6481C", "#BBA838", "#386F38", "#388589", "#385177",
    "#50964A", "#C16B0D", "#FF8500", "#45BFD3", "#FF5F2F",
    "#50F3A8", "#FF4800", "#FFDE1A", "#41D541", "#32E7EF",
    "#ef638e", "#3B7CDE", "#58FD4A", "#FF190F"
]

var province_color_themeriver = {
    "湖北":"#ffb79f",
    "广东":"#ffc9b3",
    "河南":"#f8bdbd",
    "浙江":"#eda1a7",
    "湖南":"#c08897",
    "安徽":"#9f8198",
    "江西":"#ae889c",
    "江苏":"#eac3c5",
    "重庆":"#d1b3ca",
    "山东":"#b5b6c3",
    "四川":"#97afd0",
    "黑龙江":"#27b5e1",
    "北京":"#8a8eaf",
    "上海":"#6c6b8b",
    "河北":"#624c76",
    "福建":"#452c48",
    "广西":"9578a1",
    "陕西":"#ffc7ab",
    "海南":"#ff5676",
    "云南":"#fba09c",
    "贵州":"#df4a6c",
    "山西":"#ae556e",
    "天津":"#7bafcc",
    "辽宁":"#046480",
    "甘肃":"#fafafa",
    "吉林":"#9ea5ba",
    "宁夏":"#b28d93",
    "新疆":"#ebaca6",
    "内蒙古":"#6bd7e5",
    "香港":"#584661",
    "青海":"#4d4867",
    "台湾":"#384065",
    "澳门":"#79657a",
    "西藏":"#163249"
}


var world_offset_x = {
    "意大利": 0,
    "美国": 0,
    "西班牙": 0,
    "德国": 0,
    "伊朗": 0,
    "法国": 0,
    "韩国": 0,
    "瑞士": 0,
    "英国": 0,
    "荷兰": 0,
    "比利时": 0,
    "奥地利": 0,
    "挪威": 0,
    "瑞典": 0,
    "日本": 0,
    "丹麦": 0,
    "葡萄牙": 0,
    "巴西": 0,
    "爱尔兰": 0,
    "冰岛": 0,
    "芬兰": 0,
    "加拿大": 0,
    "以色列": 0,
    "捷克": 0,
    "澳大利亚": 0,
}

var world_offset_y = {
    "意大利": 0,
    "美国": 0,
    "西班牙": 0,
    "德国": 0,
    "伊朗": 0,
    "法国": 0,
    "韩国": 0,
    "瑞士": 0,
    "英国": 0,
    "荷兰": 0,
    "比利时": 0,
    "奥地利": 0,
    "挪威": 0,
    "瑞典": 0,
    "日本": 0,
    "丹麦": 0,
    "葡萄牙": 0,
    "巴西": 0,
    "爱尔兰": 0,
    "冰岛": 0,
    "芬兰": 0,
    "加拿大": 0,
    "以色列": 0,
    "捷克": 0,
    "澳大利亚": 0,
}

var world_color_line ={
    "中国":"#f64436",
    "意大利":"#ce54cf",
    "韩国":"#7096cf",
    "美国":"#9e81ce",
    "英国":"#9cdc7a",
    "法国":"#f6ec78",
    "德国" :"#40b9d7",
    "荷兰":"#f8e5a3",
    "伊朗":"#f1965a",
    "西班牙":"#ee5caf",
    "瑞士":"#59d1c2"
}

var world_color_qipao = {
    "巴林": "#DD6B66",
    "奥地利": "#759AA0",
    "科威特": "#E69D87",
    "澳大利亚": "#8DC1A9",
    "马来西亚": "#EA7E53",
    "比利时": "#EEDD78",
    "挪威": "#73A373",
    "荷兰": "#73B9BC",
    "新加坡": "#7289AB",
    "瑞典": "#91CA8C",
    "英国": "#F49F42",
    "瑞士": "#AA312C",
    "美国": "#39656D",
    "西班牙": "#B35E45",
    "德国": "#4B8E6F",
    "法国": "#B6481C",
    "日本": "#BBA838",
    "意大利": "#386F38",
    "伊朗": "#388589",
    "冰岛": "#385177",
    "加拿大": "#50964A",
    "芬兰": "#C16B0D",
    "以色列": "#FF8500",
    "捷克": "#45BFD3",
    "吉林": "#FF5F2F",
    "卡塔尔":"#50F3A8",
    "新疆":"#FF4800",
    "宁夏":"#FFDE1A",
    "中国":"#41D541",
    "葡萄牙":"#32E7EF",
    "巴西":"#ef638e",
    "爱尔兰":"#3B7CDE",
    "丹麦":"#58FD4A",
    "韩国":"#FF190F"
}
// var world_color_qipao = {
//     "中国":"#ff1c12", //武汉
//     "韩国":"#EA7E53", //黄石
//     "意大利":"#E69D87", //十堰
//     "日本":"#759AA0", //荆州
//     "伊朗":"#386F38", //宜昌
//     "德国":"#ff6131", //襄阳
//     "新加坡":"#DD6B66", //鄂州
//     "法国":"#f1c09a", //鄂州
//     "美国":"#EEDD78", //荆门
//     "西班牙":"#ffde1d", //孝感
//     "科威特":"#52f3a9", //黄冈
//     "泰国":"#4B8E6F", //咸宁
//     "巴林":"#73A373", //恩施州
//     "瑞士":"#47c0d4", //随州
//     "英国":"#ff8603", //仙桃
//     "挪威":"#d54873", //天门
// }

var world_color_themeriver = {
    "中国":"#ffb79f",
    "韩国":"#ffc9b3",
    "日本":"#f8bdbd",
    "意大利":"#eda1a7",
    "伊朗":"#c08897",
    "新加坡":"#9f8198",
    "美国":"#ae889c",
    "德国":"#eac3c5",
    "法国":"#d1b3ca",
    "科威特":"#b5b6c3",
    "泰国":"#97afd0",
    "西班牙":"#27b5e1",
    "巴林":"#8a8eaf",
    "澳大利亚":"#6c6b8b",
    "马来西亚":"#624c76",
    "英国":"#452c48",
    "阿联酋":"9578a1",
    "越南":"#ffc7ab",
    "加拿大":"#ff5676",
    "瑞士":"#fba09c",
    "瑞典":"#df4a6c",
    "以色列":"#ae556e",
    "伊拉克":"#7bafcc",
    "阿曼":"#046480",
    "奥地利":"#fafafa",
    "俄罗斯":"#9ea5ba",
    "克罗地亚":"#b28d93",
    "挪威":"#ebaca6",
    "希腊":"#6bd7e5",
    "菲律宾":"#584661",
    "芬兰":"#4d4867",
    "黎巴嫩":"#384065",
    "荷兰":"#79657a",
    "比利时":"#163249"
}

// var province_color = {
//     "北京": "#de5991",
//     "天津": "#759AA0",
//     "河北": "#E69D87",
//     "山西": "#be3259",
//     "辽宁": "#EA7E53",
//     "黑龙江": "#EEDD78",
//     "上海": "#9359b1",
//     "江苏": "#cb8eb3",
//     "浙江": "#F49F42",
//     "安徽": "#AA312C",
//     "福建": "#B35E45",
//     "江西": "#4B8E6F",
//     "山东": "#B6481C",
//     "河南": "#BBA838",
//     "湖北": "#FF190F",
//     "湖南": "#206c71",
//     "广东": "#385177",
//     "广西": "#50964A",
//     "海南": "#C16B0D",
//     "重庆": "#245824",
//     "四川": "#45BFD3",
//     "贵州": "#50F3A8",
//     "云南": "#FF4800",
//     "陕西": "#FFDE1A",
//     "宁夏": "#41D541"
// }

const province_offset_x = {
    "广东": 5, "山东": 5, "河南": 30, "四川": 40, "江苏": 0, "河北": -25, "湖南": -25, "安徽": -20, "湖北": 0, "浙江": 35, "广西": -10, "云南": 20, "江西": 20, "辽宁": 0, "福建": 5, "陕西": 0, "黑龙江": 0, "山西": -5, "贵州": -20, "重庆": -10, "吉林": -35, "甘肃": 0, "内蒙古": -10, "新疆": -30, "上海": 0, "台湾": -0, "北京": -20, "天津": 0, "海南": 0, "香港": -2, "宁夏": 0, "青海": 25, "西藏": 0, "澳门": 0
}

const province_offset_y = {
    "广东": 45, "山东": 40, "河南": 20, "四川": 10, "江苏": -15, "河北": -5, "湖南": -15, "安徽": 35, "湖北": 35, "浙江": 20, "广西": -5, "云南": -5, "江西": 35, "辽宁": 40, "福建": -5, "陕西": 40, "黑龙江": 40, "山西": 35, "贵州": 0, "重庆": 35, "吉林": 15, "甘肃": 0, "内蒙古": -10, "新疆": 10, "上海": -5, "台湾": 10, "北京": -10, "天津": 40, "海南": 0, "香港": 0, "宁夏": 40, "青海": 20, "西藏": 0, "澳门": 0, "澳门": 0
}

const city_color = {
    "武汉":"#f99289",
    "孝感": "#fec8a5",
    "黄冈": "#febbc4",
    "荆州": "#f888c6",
    "鄂州": "#ab9cc5",
    "随州": "#9d6c87",
    "襄阳": "#86d9e2",
    "黄石": "#a1dbcb",
    "宜昌": "#d5dcbd",
    "荆门": "#fffab0",
    "咸宁": "#a2bcc6",
    "十堰": "#88a1aa",
    "仙桃": "#8eb0cb",
    "天门": "#ab9cc5",
    "恩施州": "#89bcef",
    "潜江": "#eac285",
    "神农架": "#f1c09a"
}

const qipao_city_color = {
    "武汉":"#ff1c12", //武汉
    "黄石":"#EA7E53", //黄石
    "十堰":"#E69D87", //十堰
    "荆州":"#759AA0", //荆州
    "宜昌":"#386F38", //宜昌
    "襄阳":"#ff6131", //襄阳
    "鄂州":"#DD6B66", //鄂州
    "荆门":"#EEDD78", //荆门
    "孝感":"#ffde1d", //孝感
    "黄冈":"#52f3a9", //黄冈
    "咸宁":"#4B8E6F", //咸宁
    "恩施州":"#73A373", //恩施州
    "随州":"#47c0d4", //随州
    "仙桃":"#ff8603", //仙桃
    "天门":"#d54873", //天门
    "潜江":"#1e9d95", //潜江
    "神农架":"#7289AB", //神农架
}

const city_offset_x = {
    "武汉": 0,
    "黄石": 0,
    "十堰": 0,
    "荆州": 0,
    "宜昌": 0,
    "襄阳": 0,
    "鄂州": 0,
    "荆门": 0,
    "孝感": 0,
    "黄冈": 0,
    "咸宁": 0,
    "恩施州": 0,
    "随州": 0,
    "仙桃": 0,
    "天门": 0,
    "潜江": 0,
    "神农架": 0
}

const city_offset_y = {
    "武汉": 0,
    "黄石": 0,
    "十堰": 0,
    "荆州": 0,
    "宜昌": 0,
    "襄阳": 0,
    "鄂州": 0,
    "荆门": 0,
    "孝感": 0,
    "黄冈": 0,
    "咸宁": 0,
    "恩施州": 0,
    "随州": 30,
    "仙桃": 0,
    "天门": 30,
    "潜江": 0,
    "神农架": 0
}